import qrBlue from '~/assets/qr_blue.png'
import buttonMap from '~/assets/menu/map_leave.svg'
import buttonPoint from '~/assets/menu/fire_ball_white.svg'
import ghost8 from '~/assets/ghosts/ikea.png'
import ghost9 from '~/assets/ghosts/shar.png'
import ghost10 from '~/assets/ghosts/bone.png'
import ghost11 from '~/assets/ghosts/meteo.png'
import ghost12 from '~/assets/ghosts/kasai.png'
import white279 from '~/assets/279white.svg'
import daidoLogo from '~/assets/daido_uni.svg'


export const getters = {
  aboutasp: () =>
    [
      {
        isSP: true,
        src: ghost8,
        kanas: [
          ["柴田","しばた"],
          ["アクティブストリート"],
          ["探検","たんけん"],
          ["ゲームへようこそ！ゲームを"],
          ["起動","きどう"],
          ["しながら"],
          ["柴田町","しばたちょう"],
          ["を"],
          ["探検","たんけん"],
          ["して、"],
          ["地域","ちいき"],
          ["や"],
          ["防災","ぼうさい"],
          ["について"],
          ["学","まな"],
          ["ぼう！"],
        ],
      },
      {
        isSP: true,
        src: ghost9,
        kanas: [
          ["はじめに..."],
          ["外","そと"],
          ["で"],
          ["画面","がめん"],
          ["を"],
          ["見","み"],
          ["るときは"],
          ["立","た"],
          ["ち"],
          ["止","ど"],
          ["まって！"],
          ["歩","ある"],
          ["きスマホはやめようね！"],
        ],
      },
      {
        isSP: true,
        src: buttonPoint,
        kanas: [
          ["柴田町","しばたちょう"],
          ["じゅうにはたくさんのイベントが"],
          ["待","ま"],
          ["っているよ。お"],
          ["店","みせ"],
          ["や"],
          ["公園","こうえん"],
          ["をタップすると"],
          ["情報","じょうほう"],
          ["を"],
          ["見","み"],
          ["られるよ！お"],
          ["化","ば"],
          ["けやお"],
          ["札","ふだ"],
          ["、"],
          ["新","あたら"],
          ["しいエリアに"],
          ["近","ちか"],
          ["づくとポイントゲット！"],
        ],
      },
      {
        isSP: true,
        src: white279,
        kanas: [
          ["ポイントが"],
          ["貯","た"],
          ["まったら、279ステーションでスマホを"],
          ["見","み"],
          ["せて"],
          ["記念品","きねんひん"],
          ["をゲット！"],
        ],
      },
      {
        isSP: true,
        src: buttonMap,
        kanas: [
          ["ゲームのはじめかた..."],
          ["巻","ま"],
          ["き"],
          ["物","もの"],
          ["のマークからゲームを"],
          ["始","はじ"],
          ["めよう！スマホの"],
          ["設定","せってい"],
          ["から"],
          ["位置情報","いちじょうほう"],
          ["をオンにしてね！"],
        ],
      },
      {
        isSP: true,
        src: ghost10,
        kanas: [
          ["最後","さいご"],
          ["にもう"],
          ["一度","いちど"],
          ["..."],
          ["画面","がめん"],
          ["を"],
          ["見","み"],
          ["るときは"],
          ["必","かなら"],
          ["ず"],
          ["立","た"],
          ["ち"],
          ["止","ど"],
          ["まって！"],
          ["歩","ある"],
          ["きスマホはやめようね！"],
        ],
      },
      {
        isSP: false,
        src: ghost11,
        kanas: [
          ["柴田","しばた"],
          ["アクティブストリート"],
          ["探検","たんけん"],
          ["ゲームへようこそ！ゲームを"],
          ["起動","きどう"],
          ["しながら"],
          ["柴田町","しばたちょう"],
          ["を"],
          ["探検","たんけん"],
          ["して、"],
          ["地域","ちいき"],
          ["や"],
          ["防災","ぼうさい"],
          ["について"],
          ["学","まな"],
          ["ぼう！"],
        ],
      },
      {
        isSP: false,
        src: qrBlue,
        kanas: [
          ["スマホからこのページにアクセスして、ゲームを"],
          ["始","はじ"],
          ["めよう！"],
          ["上","うえ"],
          ["のQRコードをスマホで"],
          ["読","よ"],
          ["み"],
          ["取","と"],
          ["るか、URLをスマホに"],
          ["直接入力","ちょくせつにゅうりょく"],
          ["してね！"],
        ],
      },
    ],
  members: () =>
    [
      {
        src: daidoLogo,
        mes: `柴田アクティブストリート は、「平成29年度 にぎわい創出事業」の
        一環として柴田商店街が大同大学とコラボレーションして立ち上がったプロジェクトです。`,
      },
      {
        src: ghost12,
        mes: `当サイトはプロジェクトの一環として公開され、
        大同大学の学部生および院生がプロジェクトの一部に携わっています。`,
      },
    ],
}