import qrBlue from '~/assets/qr_blue.png'
import buttonMap from '~/assets/menu/map_leave.svg'
import buttonPoint from '~/assets/menu/fire_ball_white.svg'
import ghost4 from '~/assets/ghosts/shubataro.png'
import ghost5 from '~/assets/ghosts/koike.png'
import ghost6 from '~/assets/ghosts/kasahara.png'
import ghost7 from '~/assets/ghosts/john.png'
import ghost8 from '~/assets/ghosts/ikea.png'
import ghost9 from '~/assets/ghosts/shar.png'
import ghost10 from '~/assets/ghosts/bone.png'
import ghost11 from '~/assets/ghosts/meteo.png'
import ghost12 from '~/assets/ghosts/kasai.png'
import white279 from '~/assets/279white.svg'
import daidoLogo from '~/assets/daido_uni.svg'


export const getters = {
  top: () =>
    [
      {
        isSP: true,
        src: ghost8,
        kanas: [
          ["柴田","しばた"],
          ["アクティブストリートようこそ！ゲームを"],
          ["起動","きどう"],
          ["しながら"],
          ["商店街","しょうてんがい"],
          ["でお"],
          ["買い物","かいもの"],
          ["や"],
          ["探検","たんけん"],
          ["をして、"],
          ["町","まち"],
          ["の"],
          ["歴史","れきし"],
          ["にふれながらポイントを"],
          ["貯","た"],
          ["めよう!"],
        ],
      },
      {
        isSP: true,
        src: ghost9,
        kanas: [
          ["【ゲームをはじめるまえに】"],
          ["外","そと"],
          ["で"],
          ["画面","がめん"],
          ["を"],
          ["見","み"],
          ["るときは"],
          ["立","た"],
          ["ち"],
          ["止","ど"],
          ["まって！"],
          ["歩","ある"],
          ["きスマホはやめようね！"],
        ],
      },
      {
        isSP: true,
        src: ghost5,
        kanas: [
          ["柴田町","しばたちょう"],
          ["じゅうにはたくさんのイベントが"],
          ["待","ま"],
          ["っているよ。お"],
          ["店","みせ"],
          ["や"],
          ["公園","こうえん"],
          ["をタップすると"],
          ["情報","じょうほう"],
          ["を"],
          ["見","み"],
          ["られるよ！きになるお"],
          ["化","ば"],
          ["けやお"],
          ["札","ふだ"],
          ["お"],
          ["店","みせ"],
          ["を"],
          ["見","み"],
          ["つけたら"],
          ["行","い"],
          ["ってみよう!"],
        ],
      },
      {
        isSP: true,
        src: ghost10,
        kanas: [
          ["緑","みどり"],
          ["の"],
          ["丸","まる"],
          ["はポイントのもらえるお"],
          ["店","みせ"],
          ["だよ!お"],
          ["買い物","かいもの"],
          ["をしたあとにはスマホにスタンプを"],
          ["押","お"],
          ["してもらって、ポイントをゲットしよう!"],
        ],
      },
      {
        isSP: true,
        src: ghost4,
        kanas: [
          ["茶色","ちゃいろ"],
          ["の"],
          ["丸","まる"],
          ["はようかいの"],
          ["出","で"],
          ["るポイントだよ!"],
          ["近","ちか"],
          ["くにあるQRコードを"],
          ["読","よ"],
          ["みとって、ようかいといっしょにポイントもゲット!"],
        ],
      },
      {
        isSP: true,
        src: ghost7,
        kanas: [
          ["ポイントが"],
          ["貯","た"],
          ["まったら、"],
          ["水色","みずいろ"],
          ["の"],
          ["丸","まる"],
          ["のたてもの、279ステーションに"],
          ["行","い"],
          ["こう!ポイントは"],
          ["商品券","しょうひんけん"],
          ["や"],
          ["記念品","きねんひん"],
          ["と"],
          ["交換","こうかん"],
          ["できるよ!"],
        ],
      },
      {
        isSP: true,
        src: ghost6,
        kanas: [
          ["最後","さいご"],
          ["にもう"],
          ["一度","いちど"],
          ["..."],
          ["画面","がめん"],
          ["を"],
          ["見","み"],
          ["るときは"],
          ["必","かなら"],
          ["ず"],
          ["立","た"],
          ["ち"],
          ["止","ど"],
          ["まって！"],
          ["歩","ある"],
          ["きスマホはやめようね！"],
        ],
      },
      {
        isSP: false,
        src: ghost11,
        kanas: [
          ["柴田","しばた"],
          ["アクティブストリート"],
          ["探検","たんけん"],
          ["ゲームへようこそ！ゲームを"],
          ["起動","きどう"],
          ["しながら"],
          ["柴田町","しばたちょう"],
          ["を"],
          ["探検","たんけん"],
          ["して、"],
          ["地域","ちいき"],
          ["や"],
          ["防災","ぼうさい"],
          ["について"],
          ["学","まな"],
          ["ぼう！"],
        ],
      },
      {
        isSP: false,
        src: qrBlue,
        kanas: [
          ["スマホからこのページにアクセスして、ゲームを"],
          ["始","はじ"],
          ["めよう！"],
          ["上","うえ"],
          ["のQRコードをスマホで"],
          ["読","よ"],
          ["み"],
          ["取","と"],
          ["るか、URLをスマホに"],
          ["直接入力","ちょくせつにゅうりょく"],
          ["してね！"],
        ],
      },
    ],
  about: () =>
    [
      {
        src: ghost12,
        mes: `柴田アクティブストリート は、「平成29年度 にぎわい創出事業」の
        一環として柴田商店街が大同大学とコラボレーションして立ち上がったプロジェクトです。`,
      },
      {
        src: daidoLogo,
        mes: `当サイトはプロジェクトの一環として公開され、
        大同大学の学生がプロジェクトの一部に携わっています。`,
      },
    ],
}